//============================================================================
// 
// フォントマネージャー、ヘッダーファイル [font.manager.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "singleton.h"
#include "registry.h"

//****************************************************
// フォントマネージャークラスの定義
//****************************************************
class CFontManager final : public CSingleton<CFontManager>
{
	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CFontManager>;
	friend CFontManager& CSingleton<CFontManager>::RefInstance();

	//****************************************************
	// 静的メンバ変数の定義
	//****************************************************
	static constexpr const char* INITIALIZE_PATH = "Data\\JSON\\Font.List.json";

public:

	//****************************************************
	// function
	//****************************************************

	// レジストリの参照の取得
	inline CRegistry<LPD3DXFONT>& RefRegistry() const { return *m_upRegistry; }

private:

	//****************************************************
	// special function
	//****************************************************
	CFontManager();           // デフォルトコンストラクタ
	~CFontManager() override; // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 初期化処理
	bool Initialize();

	// 終了処理
	void Finalize();

	//****************************************************
	// data
	//****************************************************
	std::unique_ptr<CRegistry<LPD3DXFONT>> m_upRegistry; // フォント用レジストリ
};