//============================================================================
// 
// ヒップドロップの衝撃、ヘッダーファイル [impact.h]
// Author : 後藤優輝
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "object.X.h"

//****************************************************
// 前方宣言
//****************************************************
class CPlayer;

//****************************************************
// 衝撃波クラスの定義
//****************************************************
class CImpact : public CObjectX
{
public:

	// デフォルトのファクトリ
	static std::function<bool(CImpact*)> s_fpDefaultFactory;

	//****************************************************
	// special function
	//****************************************************
	CImpact(OBJ::TYPE Type, OBJ::LAYER Layer); // コンストラクタ
	~CImpact() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 初期化処理
	bool Initialize();

	// 終了処理
	void Finalize();

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;
	
	//半径を設定
	void SetRadius(float Radius);

	//発生させた者を保存
	void SetCreator(CPlayer* Creator);

	//半径とか設定した後に行う最初の処理
	void Start();

private:

	//****************************************************
	// function
	//****************************************************

	//衝突判定
	void CheckCollision();

	//半径を大きくする
	void ExpandRadius();

	//球のメッシュを生成
	void CreateSphere();
	//****************************************************
	// data
	//****************************************************
	int   m_nFrame;				// フレーム数
	int   m_NowFrame;			// 現在のフレーム数
	float m_Velocity;			// 加速度
	float m_SizeTarget;			// 目標サイズ
	float m_Radius;				// 半径
	CObject* m_pCreator;		// 発生させた者
	LPD3DXMESH m_pMesh;			// メッシュの情報
};