//============================================================================
// 
// 鉄球、ヘッダーファイル [IronBall.h]
// Author : 後藤優輝
// 
//============================================================================

#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "object.X.h"

//****************************************************
// 衝撃波クラスの定義
//****************************************************
class CIronBall : public CObjectX
{
public:

	// デフォルトのファクトリ
	static std::function<bool(CIronBall*)> s_fpDefaultFactory;

	//****************************************************
	// special function
	//****************************************************
	CIronBall(OBJ::TYPE Type, OBJ::LAYER Layer); // コンストラクタ
	~CIronBall() override;                       // デストラクタ

	//****************************************************
	// function
	//****************************************************

	// 初期化処理
	bool Initialize();

	// 終了処理
	void Finalize();

	// 更新処理
	void Update() override;

	// 描画処理
	void Draw() override;

private:

	//****************************************************
	// data
	//****************************************************
	int   m_nFrame;				// フレーム数
	int   m_NowFrame;			// 現在のフレーム数
	float m_Velocity;			// 加速度
};