//============================================================================
// 
// シーン - 基底、ヘッダーファイル [scene.h]
// Author : 福田歩希
// 
//============================================================================

#pragma once

//****************************************************
// シーンクラスの定義
//****************************************************
class CScene
{
public:

	//****************************************************
	// special function
	//****************************************************
			CScene()  = default; // デフォルトコンストラクタ
	virtual ~CScene() = default; // デストラクタ

	//****************************************************
	// function
	//****************************************************


	// 更新処理
	virtual void Update() = 0;
	
	// 描画処理
	virtual void Draw() = 0;

	// 設定されている次のシーンに遷移します
	// 基本的にフレーム終わりに呼び出してください
	virtual	void Change() = 0;

//private:

	//****************************************************
	// function
	//****************************************************
	virtual bool Initialize() = 0; // 初期化処理
	virtual void Finalize()   = 0; // 終了処理
};