//============================================================================
// 
// チュートリアル [tutorial.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "tutorial.h"
#include "sound.h"

// 入力取得用
#include "renderer.h"
#include "input.manager.h"

// シーン遷移用
#include "game.h"
#include "scene.manager.h"
#include "object.manager.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CTutorial::CTutorial()
	: CScene()
{}

//============================================================================
// デストラクタ
//============================================================================
CTutorial::~CTutorial()
{
	// 終了処理
	Finalize();
}

//============================================================================
// 更新処理
//============================================================================
void CTutorial::Update()
{
#ifdef _DEBUG
	CRenderer::RefInstance().AddText("珍鳥", 1);
#endif // _DEBUG

	// 次のシーンへ遷移
	if (CInputManager::RefInstance().GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		Change();
	}
}

//============================================================================
// 描画処理
//============================================================================
void CTutorial::Draw()
{}

//============================================================================
// 次のシーンへ
//============================================================================
void CTutorial::Change()
{
	// 全オブジェクト解放予約
	CObjectManager::RefInstance().SetDeathAllObject();

	// サウンド by AKR TNK
	CSound::GetInstance()->Stop(CSound::LABEL::BGM_0);

	// ｹﾞｰﾑシーンへ変更
	up<CGame> upScene = CreateUniquePtr<CGame>();
	CSceneManager::RefInstance().ChangeScene(std::move(upScene));
}

//============================================================================
// 初期化処理
//============================================================================
bool CTutorial::Initialize()
{
	// サウンド by AKR TNK
	CSound::GetInstance()->Play(CSound::LABEL::BGM_0);

	CCamera_Manager::RefInstance().SetSelectKey("Tutorial");

	return true;
}

//============================================================================
// 終了処理
//============================================================================
void CTutorial::Finalize()
{}